maxiexe97/PILOT_Sonda-2026-MOD2/Graphics/Object Layer/Configs/HWP_PIC32_ETH_SK_SSD1963_ULTIMA_R4_16PMP.h


#ifndef __HARDWARE_PROFILE_H
    #define __HARDWARE_PROFILE_H

/*********************************************************************
* PIC Device Specific includes
*********************************************************************/
    #include "Compiler.h"

/*********************************************************************
* GetSystemClock() returns system clock frequency.
*
* GetPeripheralClock() returns peripheral clock frequency.
*
* GetInstructionClock() returns instruction clock frequency.
*
********************************************************************/

/*********************************************************************
* Macro: #define   GetSystemClock() 
*
* Overview: This macro returns the system clock frequency in Hertz.
*         * value is 8 MHz x 4 PLL for PIC24
*         * value is 8 MHz/2 x 18 PLL for PIC32
*
********************************************************************/
    #if defined(__PIC24F__)
        #define GetSystemClock()    (32000000ul)
    #elif defined(__PIC32MX__)
        #define GetSystemClock()    (80000000ul)
    #elif defined(__dsPIC33F__) || defined(__PIC24H__)
        #define GetSystemClock()    (80000000ul)
    #elif defined(__dsPIC33E__) || defined(__PIC24E__)
       #define GetSystemClock()    (120000000ul)
    #endif

/*********************************************************************
* Macro: #define   GetPeripheralClock() 
*
* Overview: This macro returns the peripheral clock frequency 
*         used in Hertz.
*         * value for PIC24 is <PRE>(GetSystemClock()/2) </PRE> 
*         * value for PIC32 is <PRE>(GetSystemClock()/(1<<OSCCONbits.PBDIV)) </PRE>
*
********************************************************************/
    #if defined(__PIC24F__) || defined(__PIC24H__) || defined(__dsPIC33F__) || defined(__dsPIC33E__) || defined(__PIC24E__)
        #define GetPeripheralClock()    (GetSystemClock() / 2)
    #elif defined(__PIC32MX__)
        #define GetPeripheralClock()    (GetSystemClock()) //** / (1 << OSCCONbits.PBDIV))
    #endif

/*********************************************************************
* Macro: #define   GetInstructionClock() 
*
* Overview: This macro returns instruction clock frequency 
*         used in Hertz.
*         * value for PIC24 is <PRE>(GetSystemClock()/2) </PRE> 
*         * value for PIC32 is <PRE>(GetSystemClock()) </PRE> 
*
********************************************************************/
    #if defined(__PIC24F__) || defined(__PIC24H__) || defined(__dsPIC33F__) || defined(__dsPIC33E__) || defined(__PIC24E__)
        #define GetInstructionClock()   (GetSystemClock() / 2)
    #elif defined(__PIC32MX__)
        #define GetInstructionClock()   (GetSystemClock())
    #endif

/* ################################################################## */
/*********************************************************************
* START OF GRAPHICS RELATED MACROS
********************************************************************/
/* ################################################################## */
//**
#define ULTIMA_R4_BOARD
//**
/*
**************************************************************************************************   
* PIC32_GP_SK / PIC32_USB_SK / PIC32_ETH_SK / EXPLORER_16 defines what mcu host to use.
* It is possible to stack any of the PIC32 starter kits or just using Explorer 16 as the host.
* This version assumes PIC32MX360F512L on Explorer 16, however, it is not a strict requirement.
* New driver can be developed with different MCU by following the schematic.
**************************************************************************************************   
*/
#define PIC32_ETH_SK
#define USE_16BIT_PMP
#ifdef USE_TY430TFT480272
#define GFX_DISPLAY_BUFFER_START_ADDRESS 0   //To support USE_DOUBLE_BUFFERING in GraphicsConfig.h, only valid for TY430TFT480272
#define GFX_DRV_PAGE_COUNT   4            //480*272*2*4 = 1,044,480 bytes
#define GFX_DISPLAY_BUFFER_LENGTH   GFX_REQUIRED_DISPLAY_BUFFER_SIZE_IN_BYTES 
#endif


/*********************************************************************
* HARDWARE DEVICES SELECTION
*********************************************************************/
#if defined (ULTIMA_R4_BOARD)
      #define   USE_SST25VF016
         #define   USE_BEEPER                        // use the PWM controlled beeper 
#endif

#if defined (USE_TY430TFT480272) || defined (USE_TY500TFT800480) || defined (USE_TY700TFT800480) || defined (USE_TY700TFT800480_R3)
        //**
      #define      USE_TOUCHSCREEN               //USE_TOUCHSCREEN defined in GraphicsConfig.h
        //**
          #define      USE_TOUCHSCREEN_RESISTIVE            // use 4-wire resistive touch screen driver
#endif

#if defined (USE_TY600TFT800480)
       #error TY600TFT not supported yet
#endif


/*********************************************************************
* STARTER KIT SPECIFIC MACROS (NOT USEFUL HERE)
*********************************************************************/

#ifdef PIC_SK
   #if defined (__PIC32MX__)
         #define PIC32_SK 
   #elif defined (__dsPIC33E__) || (__PIC24E__)
         #define dsPIC33E_SK
   #endif
#endif


// -----------------------------------
// For RGB GLASS
// -----------------------------------
#if defined (USE_TY430TFT480272)
   /*
   *********************************************************************
   * TIMING PARAMETERS FOR 4.3" TFT PANEL (480x272):
   * PART# TY430TFT480272
   *********************************************************************
   */
   /*********************************************************************
   * Overview: Horizontal and vertical display resolution
   *                  (from the glass datasheet).
   *********************************************************************/
   #define DISP_HOR_RESOLUTION            480
   #define DISP_VER_RESOLUTION            272
   /*********************************************************************
   * Overview: Image orientation (can be 0, 90, 180, 270 degrees).
   *********************************************************************/
   #define DISP_ORIENTATION            0
   /*********************************************************************
   * Overview: Panel Data Width
   *********************************************************************/
   #define DISP_DATA_WIDTH                 24
   /*********************************************************************
   * Overview: LSHIFT Polarity Swap
   * If defined LSHIFT is a falling trigger
   *********************************************************************/
   //#define DISP_INV_LSHIFT
   /*********************************************************************
   * Overview: Horizontal synchronization timing in pixels
   *                  (from the glass datasheet).
   *********************************************************************/
   #define DISP_HOR_PULSE_WIDTH      41  
   #define DISP_HOR_BACK_PORCH         2
   #define DISP_HOR_FRONT_PORCH      2   
   /*********************************************************************
   * Overview: Vertical synchronization timing in lines
   *                  (from the glass datasheet).
   *********************************************************************/
   #define DISP_VER_PULSE_WIDTH      10
   #define DISP_VER_BACK_PORCH         2   
   #define DISP_VER_FRONT_PORCH      2


   
   /*********************************************************************
   * Definition for SPI interface for SSD1963 
   * Hardware dependent!
   *********************************************************************/
   #define GPIO3 3
   #define GPIO2 2
   #define GPIO1 1
   #define GPIO0 0
   #define LCD_RESET (1<<GPIO0)      //LCD Reset signal (Reset for display panel, NOT ssd1963)
   #define LCD_SPENA   0
   #define LCD_SPCLK   0
   #define LCD_SPDAT   0
   /* End of definition for TY430TFT480272 */
#elif defined (USE_TY500TFT800480)
   /*
   *********************************************************************
   * TIMING PARAMETERS FOR 5" TFT PANEL (800x480):
   * PART# TY500TFT800480
   *********************************************************************
   */
   /*********************************************************************
   * Overview: Horizontal and vertical display resolution
   *                  (from the glass datasheet).
   *********************************************************************/
   #define DISP_HOR_RESOLUTION            800
   #define DISP_VER_RESOLUTION            480
   /*********************************************************************
   * Overview: Image orientation (can be 0, 90, 180, 270 degrees).
   *********************************************************************/
   #define DISP_ORIENTATION            0
   /*********************************************************************
   * Overview: Panel Data Width
   *********************************************************************/
   #define DISP_DATA_WIDTH                 24
   /*********************************************************************
   * Overview: LSHIFT Polarity Swap
   * If defined LSHIFT is a falling trigger
   *********************************************************************/
   //#define DISP_INV_LSHIFT
   /*********************************************************************
   * Overview: Horizontal synchronization timing in pixels
   *                  (from the glass datasheet).
   *********************************************************************/

   #define DISP_HOR_PULSE_WIDTH      128  
   #define DISP_HOR_BACK_PORCH         88
   #define DISP_HOR_FRONT_PORCH      40   

   /*********************************************************************
   * Overview: Vertical synchronization timing in lines
   *                  (from the glass datasheet).
   *********************************************************************/

   #define DISP_VER_PULSE_WIDTH      2
   #define DISP_VER_BACK_PORCH         25   
   #define DISP_VER_FRONT_PORCH      18


   /*********************************************************************
   * Definition for SPI interface for SSD1963 
   * Hardware dependent!
   *********************************************************************/
   #define GPIO3 3
   #define GPIO2 2
   #define GPIO1 1
   #define GPIO0 0
   #define LCD_RESET (1<<GPIO0)      //LCD Reset signal (Reset for display panel, NOT ssd1963)
   #define LCD_SPENA   0
   #define LCD_SPCLK   0
   #define LCD_SPDAT   0
   /* End of definition for DISPLAY_PANEL == TY500TFT800480 */
#elif defined (USE_TY700TFT800480)
   /*
   *********************************************************************
   * TIMING PARAMETERS FOR 7" TFT PANEL (800x480):
   * PART# TY700TFT800480
   * Reamrks:    By accident, a QA procedure for TY700TFT800480 discovered!
   *         Set all parameters as follows for a built-in display 
   *         R,G,B, and B&W spare pattern
   *      #define DISP_VER_PULSE_WIDTH      0
   *      #define DISP_VER_BACK_PORCH         0   
   *      #define DISP_VER_FRONT_PORCH      0
   *
   *      Normal operating values 
   *      #define DISP_VER_PULSE_WIDTH      1
   *      #define DISP_VER_BACK_PORCH         34   
   *      #define DISP_VER_FRONT_PORCH      10
   *********************************************************************
   */
   /*********************************************************************
   * Overview: Image orientation (can be 0, 90, 180, 270 degrees).
   *********************************************************************/   
     #define DISP_ORIENTATION    0
   /*********************************************************************
   * Overview: Panel Data Width (R,G,B) in (6,6,6)
   *********************************************************************/
   #define DISP_DATA_WIDTH                 18
   /*********************************************************************
   * Overview: Horizontal and vertical display resolution
   *                  (from the glass datasheet).
   *********************************************************************/
   #define DISP_HOR_RESOLUTION 800
   #define DISP_VER_RESOLUTION 480
   /*********************************************************************
   * Overview: Horizontal synchronization timing in pixels
   *                  (from the glass datasheet).
   *********************************************************************/
   #define DISP_HOR_PULSE_WIDTH      1
   #define DISP_HOR_BACK_PORCH         210
   #define DISP_HOR_FRONT_PORCH      45   
   /*********************************************************************
   * Overview: Vertical synchronization timing in lines
   *                  (from the glass datasheet).
   *********************************************************************/
   #if defined (TY700TFT_USE_QA_PATTERN)
      #define DISP_VER_PULSE_WIDTH      0
      #define DISP_VER_BACK_PORCH         0   
      #define DISP_VER_FRONT_PORCH      0
   #else
      #define DISP_VER_PULSE_WIDTH      1
      #define DISP_VER_BACK_PORCH         34   
      #define DISP_VER_FRONT_PORCH      10
   #endif

   /*********************************************************************
   * Definition for SPI interface for SSD1963 
   * Hardware dependent!
   *********************************************************************/
   #define GPIO3 3
   #define GPIO2 2
   #define GPIO1 1
   #define GPIO0 0
   #define LCD_RESET    0
   #define LCD_SPENA   0
   #define LCD_SPCLK   0
   #define LCD_SPDAT   0
   /* End of definition for TY700TFT800480 */
#elif defined (USE_TY700TFT800480_R3)
   /*
   *********************************************************************
   * TIMING PARAMETERS FOR 7" TFT PANEL (800x480) version 2 high lumin
   * PART# TY700TFT800480_R3
   *********************************************************************
   */
   /*********************************************************************
   * Overview: Horizontal and vertical display resolution
   *                  (from the glass datasheet).
   *********************************************************************/
   #define DISP_HOR_RESOLUTION            800
   #define DISP_VER_RESOLUTION            480
   /*********************************************************************
   * Overview: Image orientation (can be 0, 90, 180, 270 degrees).
   *********************************************************************/
   #define DISP_ORIENTATION            0
   /*********************************************************************
   * Overview: Panel Data Width
   *********************************************************************/
   #define DISP_DATA_WIDTH                 24
   /*********************************************************************
   * Overview: LSHIFT Polarity Swap
   * If defined LSHIFT is a falling trigger
   *********************************************************************/
   //#define DISP_INV_LSHIFT
   /*********************************************************************
   * Overview: Horizontal synchronization timing in pixels
   *                  (from the glass datasheet).
   *********************************************************************/
   #define DISP_HOR_PULSE_WIDTH      3 
   #define DISP_HOR_BACK_PORCH         88
   #define DISP_HOR_FRONT_PORCH      37   


   /*********************************************************************
   * Overview: Vertical synchronization timing in lines
   *                  (from the glass datasheet).
   *********************************************************************/
   #define DISP_VER_PULSE_WIDTH      3
   #define DISP_VER_BACK_PORCH         32   
   #define DISP_VER_FRONT_PORCH      10


   /*********************************************************************
   * Definition for SPI interface for SSD1963 
   * Hardware dependent!
   *********************************************************************/
   #define GPIO3 3
   #define GPIO2 2
   #define GPIO1 1
   #define GPIO0 0
   #define LCD_RESET (1<<GPIO0)      //LCD Reset signal (Reset for display panel, NOT ssd1963)
   #define LCD_SPENA   0
   #define LCD_SPCLK   0
   #define LCD_SPDAT   0
   /* End of definition for DISPLAY_PANEL == TY700TFT800480_R3 */

#endif   //end of definition of RGB glasses

/*********************************************************************
* HARDWARE PROFILE FOR DISPLAY CONTROLLER INTERFACE
*********************************************************************/
/*
*********************************************************************
* IO port definitions.
* Two board combinations: 
* (1) PIC32 starter kit on ULTIMA_R4       -or-  
* (2) Explorer 16 connected to ULTIMA_R4
* (3) PIC32MX360F512L EVK RD5B connected to SSD1963 Ultima EVK Rev4.1
*
* Function      mcu pins               SSD1963
* ==========   ========               ========
* TE         INT2/RE9               TE
* DATA LINES   PMD[15:0]               D[15:0] in 16-bit addressing
* RESET         RD1                     /RESET
* CHIP SELECT   PMPA0/RB15               /CS
* COMMAND/DATA   RD3                     RS 
* WR STROBE      RD4/PMPWR(1/3) or RD0(2)   /WR
* RD STROBE      RD5/PMPRD               /RD
*
*********************************************************************
*/

