maxiexe97/PILOT_Sonda-2026-MOD2/Graphics/Object Layer/Configs/HWP_PIC32_ETH_SK_SSD1963_ULTIMA_R4_16PMP.h
#if defined (ULTIMA_R4_BOARD)
   //Definitions for TE pin of SSD1963
   #define TE_TRIS_BIT         TRISEbits.TRISE9
   #define TE_PORT_BIT         PORTEbits.RE9
   #define RST_TRIS_BIT       TRISAbits.TRISA15
   #define RST_LAT_BIT        LATAbits.LATA15
   // Definitions for CS pin
   #define CS_TRIS_BIT        TRISDbits.TRISD10  //B14   //D10 ->Placa   //set digital under ResetDevice req.
   #define CS_LAT_BIT         LATDbits.LATD10    //B14     //D10        //it is AN15
   //Definition for RS pin
   #define RS_TRIS_BIT         TRISGbits.TRISG15   
   #define RS_LAT_BIT         LATGbits.LATG15    //G15      //G3    
   // Definition for RD pin
   #define RD_TRIS_BIT         TRISDbits.TRISD5
   #define RD_LAT_BIT         LATDbits.LATD5

   #if defined (EXPLORER_16)
   //   #define WR_TRIS_BIT         TRISDbits.TRISD0   //RD4 in Explorer 16 using for LCD2's E pin
   //   #define WR_LAT_BIT         LATDbits.LATD0
   #elif defined (PIC32_GP_SK) || defined (PIC32_USB_SK) || defined (PIC32_ETH_SK)   || defined (PIC32MX360F512L_EVK_RD5B)
      #define WR_TRIS_BIT         TRISDbits.TRISD4 
      #define WR_LAT_BIT         LATDbits.LATD4    //D4      //D11
   #endif

#endif

/*********************************************************************
* HARDWARE PROFILE FOR THE RESISTIVE TOUCHSCREEN 
*********************************************************************/
/*
   These are the hardware settings for the 4-wire resistive
   touch screen. There are two analog inputs and two digital I/Os
   needed. 
   
   This portion is divided into 3 components
   1. IO and ADC channels settings - sets up the IO pins used and the
      ADC channel selected to evaluate the screen touch. 
   2. Touch Screen X and Y orientation settings - sets up the
      x and y directions. This is dependent on how the resistive
      touch signals (X-, Y-, X+, and Y+) are wired up to the 
      IOs and ADC signals with respect to the orientation of the
      screen. Based on these factors, we can control the calculation
      of the touch by swapping x and/or y and flipping the x and/or y 
      directions.
   3. Touch Screen Non-Volatile Memory Storage Macros - this defines
      the non-volatile memory read, write and sector erase functions
      to be used when reading or storing calibration values.    
   
   The resistive touch screen driver assumes the following: 
   1. X+ and Y+ are mapped to the A/D inputs
   2. X- and Y- are mapped to the pure digital I/Os
*/


// ********************************************************************
// * HARDWARE PROFILE FOR THE POTENTIOMETER
// ********************************************************************
#define ADC_POT        ADC_CH0_POS_SAMPLEA_AN4
#define ADC_POT_PCFG   AD1PCFGbits.PCFG4
/*****************************************************************
*  ADC para las entradas de los sensores de presion
******************************************************************/
#define ADC_SENSOR_1        ADC_CH0_POS_SAMPLEA_AN1 
#define ADC_SENSOR_1_PCFG   AD1PCFGbits.PCFG1  
//****************************************************************/

/*****************************************************************
*  Salidas Digitales para la electrovalvula
******************************************************************/
       #define Electro_valvula_TRIS_BIT   TRISBbits.TRISB14     //B14 si es la electrovalvula
       #define Electro_valvula_LAT_BIT    LATBbits.LATB14         //B14
//***************************************************************//

/*****************************************************************
*  Salidas Digital para el calefactor
******************************************************************/
       #define Calefactor_TRIS_BIT   TRISDbits.TRISD14      //D14 vieja
       #define Calefactor_LAT_BIT    LATDbits.LATD14        //D14

//***************************************************************//
       #define Electro_IN_TRIS_BIT   TRISBbits.TRISB15      //
       #define Electro_IN_LAT_BIT    LATBbits.LATB15        //  
	   
//***************************************************************//
       #define BUZZER_TRIS_BIT   TRISBbits.TRISB12   // era b8   
       #define BUZZER_LAT_BIT    LATBbits.LATB12  

   	   #define DATO_TRIS_BIT   TRISFbits.TRISF5      //b11
       #define DATO_port       PORTFbits.RF5

  	   #define DATO2_TRIS_BIT   TRISFbits.TRISF4      //b11
       #define DATO2_port       PORTFbits.RF4

   /*********************************************************************
   * Touch Screen X and Y orientation
   *********************************************************************/
   /*********************************************************************
   Description:
      The usage of the resistive touch screen will be affected 
      by the way the hardware is mapped to the A/D channels that
      samples the touch. Since resistive touch is basically a 
      measurement of X and Y coordinates the following are macros
      that can modify the touch algorithm when sampling the 
      touch.
      TOUCHSCREEN_RESISTIVE_FLIP_X - will flip the x direction.    
      TOUCHSCREEN_RESISTIVE_FLIP_Y - will flip the y direction.
      TOUCHSCREEN_RESISTIVE_SWAP_XY - will swap the x and y sampling.
      
      As long as the (X-,Y-) and (X+,Y+) are used consistently,
      and connected properly in hardware, the macros above
      can provide options to the user to align the touch screen
      to the screen orientation.

        Another macro that may affect the way the x and y measurement 
        are the following:
        TOUCHSCREEN_RESISTIVE_PRESS_THRESHOLD - determines how light the 
            touch on the screen. The smaller the  value the lighter the 
            touch. Valid range of values: 0-0x03ff
        TOUCHSCREEN_RESISTIVE_CALIBRATION_SCALE_FACTOR - this is the scale
            factor used to calculate the touch coefficients. The equation 
            to calculate the scale factor is:
               (1 << TOUCHSCREEN_RESISTIVE_CALIBRATION_SCALE_FACTOR).
            Valid values: 0 - 15 (most resistive touch screens will work 
                                  in the range of 5 - 7)

   *********************************************************************/

#if defined (USE_TY430TFT480272) || defined (USE_TY500TFT800480) || defined (USE_TY700TFT800480) || defined (USE_TY700TFT800480_R3)
         #if (DISP_ORIENTATION == 0)
         #elif (DISP_ORIENTATION == 180)   
            #error DISP_ORIENTATION 180 DEG not supported yet
         #elif (DISP_ORIENTATION == 270)   
            #error DISP_ORIENTATION 270 DEG not supported yet
         #endif
#endif

   /*********************************************************************
   * Touch Screen Non-Volatile Memory Storage Macros
   *********************************************************************/
   /* ----------------------------------------- */
   #if defined (USE_MCHP25LC256)  
   /* ----------------------------------------- */
      // for  MCHP25LC256 serial EEPROM or AT25256 serial EEPROM
      // Addresses for calibration and version values in EEPROM on MMEVK R1A / ULTIMA
        #define ADDRESS_RESISTIVE_TOUCH_VERSION (unsigned)0x7FFE
        #define ADDRESS_RESISTIVE_TOUCH_COEFA   (unsigned)0x7FFC
        #define ADDRESS_RESISTIVE_TOUCH_COEFB   (unsigned)0x7FFA
        #define ADDRESS_RESISTIVE_TOUCH_COEFC   (unsigned)0x7FF8
        #define ADDRESS_RESISTIVE_TOUCH_COEFD   (unsigned)0x7FF6

