maxiexe97/PILOT_Sonda-2026-MOD2/Graphics/Object Layer/Configs/HWP_PIC32_ETH_SK_SSD1963_ULTIMA_R4_16PMP.h
        // define the functions to call for the non-volatile memory
        // check out touch screen module for definitions of the following function pointers
        // used: NVM_READ_FUNC, NVM_WRITE_FUNC & NVM_SECTORERASE_FUNC
      #define NVMSectorErase               ((NVM_SECTORERASE_FUNC)0)
       #define NVMWrite                   ((NVM_WRITE_FUNC)&MCHP25LC256WriteWord)
       #define NVMRead                   ((NVM_READ_FUNC)&MCHP25LC256ReadWord)

   #elif defined (USE_SST25VF016) || defined (USE_M25P80)
      // Addresses for calibration and version values in SPI Flash on ULTIMA_R4 board
        #define ADDRESS_RESISTIVE_TOUCH_VERSION   (unsigned long)0xFFFFFFFE
        #define ADDRESS_RESISTIVE_TOUCH_COEFA   (unsigned long)0xFFFFFFFC
        #define ADDRESS_RESISTIVE_TOUCH_COEFB   (unsigned long)0xFFFFFFFA
        #define ADDRESS_RESISTIVE_TOUCH_COEFC   (unsigned long)0xFFFFFFF8
        #define ADDRESS_RESISTIVE_TOUCH_COEFD   (unsigned long)0xFFFFFFF6

        // define the functions to call for the non-volatile memory
        // check out touch screen module for definitions of the following function pointers
        // used: NVM_READ_FUNC, NVM_WRITE_FUNC & NVM_SECTORERASE_FUNC
   #define NVMSectorErase               ((NVM_SECTORERASE_FUNC)&SST25SectorErase)
       #define NVMWrite                   ((NVM_WRITE_FUNC)&SST25WriteWord)
       #define NVMRead                   ((NVM_READ_FUNC)&SST25ReadWord)

   #endif

/*********************************************************************
* HARDWARE PROFILE FOR THE SPI FLASH MEMORY
*********************************************************************/
/*
   These are the hardware settings for the SPI peripherals used.
*/
#if defined (USE_MCHP25LC256) 

    /*********************************************************************
   * Serial Bus SPI EEPROM (MCHP 25LC256) On MMEVK R1A / ULTIMA
   *********************************************************************/
    /* Define all the SPI channels that will be used here.
       These will be used to determine how the SPI Driver (drv_spi)
       will be compiled.
    */
/*
   #define MCHP25LC256_SPI_CHANNEL 1
   #define SPI_CHANNEL_1_ENABLE
   // CS signal definition
   #define MCHP25LC256_CS_TRIS       TRISDbits.TRISD9
    #define MCHP25LC256_CS_LAT        LATDbits.LATD9
    // Clock, SDO and SDI signals
   #if defined (__32MX360F512L__)
   #define MCHP25LC256_SCK_TRIS      TRISFbits.TRISF6
   #define MCHP25LC256_SDO_TRIS      TRISFbits.TRISF8
   #define MCHP25LC256_SDI_TRIS      TRISFbits.TRISF7
   #elif defined (__32MX795F512L__) || defined (__32MX460F512L__)
   #define MCHP25LC256_SCK_TRIS      TRISDbits.TRISD10
   #define MCHP25LC256_SDO_TRIS      TRISDbits.TRISD0
   #define MCHP25LC256_SDI_TRIS      TRISCbits.TRISC4
   #endif
*/
#elif defined (USE_SST25VF016) || defined (USE_M25P80)
    /*********************************************************************
   * Serial Bus SPI Flash (SST25VF016 or compatible M25P80) On ULTIMA_R4
   *********************************************************************/
    /* Define all the SPI channels that will be used here.
       These will be used to determine how the SPI Driver (drv_spi)
       will be compiled.
    */
   #define SST25_SPI_CHANNEL   1

    #if (SST25_SPI_CHANNEL == 1)
        #define SPI_CHANNEL_1_ENABLE
    #elif (SST25_SPI_CHANNEL == 2)
        #define SPI_CHANNEL_2_ENABLE
    #elif (SST25_SPI_CHANNEL == 3)
        #define SPI_CHANNEL_3_ENABLE
    #elif (SST25_SPI_CHANNEL == 4)
        #define SPI_CHANNEL_4_ENABLE
    #endif

   
   #define SST25_CS_TRIS        TRISDbits.TRISD9
    #define SST25_CS_LAT         LATDbits.LATD9

   #if defined (__32MX360F512L__)
   #define SST25_SCK_TRIS      TRISFbits.TRISF6
   #define SST25_SDO_TRIS      TRISFbits.TRISF8
   #define SST25_SDI_TRIS      TRISFbits.TRISF7
   #elif defined (__32MX795F512L__) || defined (__32MX460F512L__)
   #define SST25_SCK_TRIS      TRISDbits.TRISD10
   #define SST25_SDO_TRIS      TRISDbits.TRISD14    //D0
   #define SST25_SDI_TRIS      TRISCbits.TRISC4
   #endif
#endif

/*********************************************************************
* IO FOR THE BEEPER
*********************************************************************/
#if defined (USE_BEEPER)
        #define BEEP_TRIS_BIT   TRISDbits.TRISD0 
        #define BEEP_LAT_BIT    LATDbits.LATD0

 //      #define BEEP_TRIS_BIT   TRISBbits.TRISB8   // PARA QUE SUENE BUZZER
  //     #define BEEP_LAT_BIT    LATBbits.LATB8  


        #define SALIDA_BEEPER_TRIS_BIT                 TRISDbits.TRISD0     //F12
        #define SALIDA_BEEPER_pin                      LATDbits.LATD0        //F12
#endif



#endif
